# KeyType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Field..::..KeyType Property
Field Class See Also
---
The type of the keys stored in the field.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Type KeyType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property KeyType As Type
	Get
```

Visual C++
---
```text
public:
property Type^ KeyType {
	Type^ get ();
}
```

# Remarks
For key-value maps, this is the key type. For all other field, this is NULL.
# See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace